'use client';

import React, {  useState, useEffect} from 'react';
import { useSpring, animated } from 'react-spring';
import styles from './Description.module.css';



export default function Description() {
  const [isAnimating, setIsAnimating] = useState(true);

  const subjects = [
    { id: 1, name: 'Биология', color: '#CDE0A4' },
    { id: 2, name: 'Химия', color: '#D4DDEE' },
    { id: 3, name: 'Русский язык', color: '#F9E48A' },
    { id: 4, name: 'Профильная математика', color: '#B3D4E5' },
    { id: 5, name: 'Обществознание', color: '#ACD5B7' },
    { id: 6, name: 'История', color: '#F5C6AA' },
    { id: 7, name: 'Физика', color: '#76C1C1' },
    { id: 8, name: 'Литература', color: '#F4BE9A' },
    { id: 9, name: 'Информатика', color: '#DBDBDB' },
    { id: 10, name: 'Английский язык', color: '#7CB8E0' },
    { id: 11, name: 'География', color: '#A3D8AF' },
    { id: 12, name: 'Базовая математика', color: '#B3D4E5' },
  ];


  const textSpringProps = useSpring({
    to: async (next) => {
      if (isAnimating) {
        await next({ transform: 'rotate(-10deg)' });
        await next({ transform: 'rotate(10deg)' });
        await next({ transform: 'rotate(0deg)' });
      }
    },
    from: { transform: 'rotate(0deg)' },
    config: { duration: 500 },
    onRest: () => {
      // Когда анимация завершена, устанавливаем isAnimating в false
      setIsAnimating(false);
    },
  });

  useEffect(() => {
    const interval = setInterval(() => {
      setIsAnimating(true);
    }, 17000);

    // Очистка интервала при размонтировании компонента
    return () => clearInterval(interval);
  }, []);


  return (
    <div className={styles.container}>
      <div className={styles['block-subject']}>
        {subjects.map((subject) => (
          <animated.div
            key={subject.id}
            className={styles['subject']}
            style={{...textSpringProps, backgroundColor: subject.color}}
          >
            <svg
              className={styles['svg-icon']}
              width="17"
              height="17"
              viewBox="0 0 17 17"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <rect
                x="0.75"
                y="0.206421"
                width="16.1134"
                height="16.1134"
                rx="8.05668"
                transform="rotate(0.214815 0.75 0.206421)"
                fill="#302A3E"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M12.5902 4.11938H9.64755C9.32631 4.11938 9.16543 4.50778 9.39258 4.73494L10.3715 5.71386L8.28411 7.80125C8.01245 8.07291 8.01245 8.51336 8.28411 8.78502C8.55577 9.05667 8.99622 9.05667 9.26787 8.78502L11.3553 6.69762L12.3352 7.67758C12.5624 7.90473 12.9508 7.74385 12.9508 7.42261V4.47997C12.9508 4.28082 12.7893 4.11938 12.5902 4.11938ZM8.08066 4.58326C8.46484 4.58326 8.77629 4.8947 8.77629 5.27888C8.77629 5.66306 8.46484 5.9745 8.08066 5.9745H6.92129C6.40904 5.9745 5.99379 6.38976 5.99379 6.902V10.1483C5.99379 10.6605 6.40904 11.0758 6.92129 11.0758H10.1675C10.6798 11.0758 11.095 10.6605 11.095 10.1483V8.98888C11.095 8.60469 11.4065 8.29325 11.7907 8.29325C12.1748 8.29325 12.4863 8.60469 12.4863 8.98888V10.1483C12.4863 11.4289 11.4481 12.467 10.1675 12.467H6.92129C5.64068 12.467 4.60254 11.4289 4.60254 10.1483V6.902C4.60254 5.62139 5.64068 4.58326 6.92129 4.58326H8.08066Z"
                fill="white"
              />
            </svg>

            {subject.name}
          </animated.div>
        ))}
        <div className={styles.vector}>
          <svg
            width="118"
            height="52"
            viewBox="0 0 118 52"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M117.176 51.0145C117.72 50.9178 118.082 50.3985 117.986 49.8548C117.889 49.311 117.37 48.9487 116.826 49.0454L117.176 51.0145ZM3.14367 0.0401983C2.59715 -0.0393803 2.0896 0.339151 2.01002 0.885674L0.713215 9.79176C0.633636 10.3383 1.01218 10.8458 1.55869 10.9254C2.10521 11.005 2.61277 10.6265 2.69234 10.0799L3.84506 2.16342L11.7616 3.31613C12.3081 3.39571 12.8157 3.01718 12.8952 2.47065C12.9748 1.92413 12.5963 1.41658 12.0498 1.337L3.14367 0.0401983ZM73.9993 28.0296L74.8226 28.5971L73.9993 28.0296ZM61.4969 16.5296L61.8683 17.4581L61.4969 16.5296ZM73.1759 27.462C66.4098 37.2777 59.2648 40.9807 52.3142 41.1058C45.2913 41.2323 38.2089 37.7159 31.6007 32.5292C18.3748 22.1481 7.62827 5.56344 3.8012 0.431921L2.19797 1.6276C5.9007 6.5924 16.8676 23.5076 30.3659 34.1024C37.1198 39.4036 44.6522 43.2441 52.3502 43.1055C60.1205 42.9656 67.8024 38.7814 74.8226 28.5971L73.1759 27.462ZM116.826 49.0454C99.0472 52.2085 79.8038 46.1775 67.8031 38.2337C61.7754 34.2436 57.7607 29.893 56.5439 26.1561C55.9489 24.3286 56.0375 22.7042 56.8143 21.3014C57.6038 19.8758 59.1856 18.5313 61.8683 17.4581L61.1255 15.6012C58.1841 16.7779 56.1521 18.3689 55.0647 20.3325C53.9647 22.3189 53.9135 24.5375 54.6422 26.7753C56.0727 31.1687 60.5593 35.8371 66.6992 39.9014C79.0337 48.0663 98.7908 54.2855 117.176 51.0145L116.826 49.0454ZM61.8683 17.4581C63.1403 16.9492 64.8381 16.831 66.628 17.1147C68.4091 17.3969 70.1936 18.0639 71.6156 19.0274C73.0417 19.9936 74.0335 21.2071 74.3866 22.5639C74.7314 23.889 74.512 25.5239 73.1759 27.462L74.8226 28.5971C76.4162 26.2853 76.8425 24.0601 76.3221 22.0602C75.81 20.092 74.4256 18.5154 72.7375 17.3716C71.0453 16.2251 68.9775 15.462 66.941 15.1393C64.9134 14.818 62.8285 14.9199 61.1255 15.6012L61.8683 17.4581Z"
              fill="black"
            />
          </svg>
        </div>
      </div>

      <div className={styles['section-description']}>
        <div>
          <h3 className={styles.title}>Банк заданий по всем предметам</h3>
        </div>
        <div className={styles['block-description']}>
          <span className={styles.description}>
            Десятки тысяч качественных заданий по твоим <br /> предметам.
            Формата ЕГЭ-2024, уровня сложности <br /> экзамена и выше, с
            ответами и пояснениями. Можно <br /> фильтровать по темам, линиям
            или использовать <br />
            поиск! 
          </span>
        </div>

        <div>
          <span className={styles.call}>
            Выбирай предмет и переходи <br /> в Банк заданий прямо сейчас!
          </span>
        </div>
      </div>
    </div>
  );
}
